/* automatically generated by rust-bindgen 0.70.1 */

pub const SSL_V30: u32 = 768;
pub const TLS_V10: u32 = 769;
pub const TLS_V11: u32 = 770;
pub const TLS_V12: u32 = 771;
pub const TLS_V13: u32 = 772;
pub const DTLS_V10: u32 = 65279;
pub const DTLS_V12: u32 = 65277;
pub const DTLS_V13: u32 = 65276;
pub const TLS_NEED_MORE_DATA: u32 = 0;
pub const TLS_GENERIC_ERROR: i32 = -1;
pub const TLS_BROKEN_PACKET: i32 = -2;
pub const TLS_NOT_UNDERSTOOD: i32 = -3;
pub const TLS_NOT_SAFE: i32 = -4;
pub const TLS_NO_COMMON_CIPHER: i32 = -5;
pub const TLS_UNEXPECTED_MESSAGE: i32 = -6;
pub const TLS_CLOSE_CONNECTION: i32 = -7;
pub const TLS_COMPRESSION_NOT_SUPPORTED: i32 = -8;
pub const TLS_NO_MEMORY: i32 = -9;
pub const TLS_NOT_VERIFIED: i32 = -10;
pub const TLS_INTEGRITY_FAILED: i32 = -11;
pub const TLS_ERROR_ALERT: i32 = -12;
pub const TLS_BROKEN_CONNECTION: i32 = -13;
pub const TLS_BAD_CERTIFICATE: i32 = -14;
pub const TLS_UNSUPPORTED_CERTIFICATE: i32 = -15;
pub const TLS_NO_RENEGOTIATION: i32 = -16;
pub const TLS_FEATURE_NOT_SUPPORTED: i32 = -17;
pub const TLS_DECRYPTION_FAILED: i32 = -20;
pub const TLS_AES_128_GCM_SHA256: u32 = 4865;
pub const TLS_AES_256_GCM_SHA384: u32 = 4866;
pub const TLS_CHACHA20_POLY1305_SHA256: u32 = 4867;
pub const TLS_AES_128_CCM_SHA256: u32 = 4868;
pub const TLS_AES_128_CCM_8_SHA256: u32 = 4869;
pub const TLS_RSA_WITH_AES_128_CBC_SHA: u32 = 47;
pub const TLS_RSA_WITH_AES_256_CBC_SHA: u32 = 53;
pub const TLS_RSA_WITH_AES_128_CBC_SHA256: u32 = 60;

        buf_len: ::std::os::raw::c_int,
        addr: *mut ::std::os::raw::c_uchar,
        port: ::std::os::raw::c_int,
        is_ipv6: ::std::os::raw::c_uchar,
        write_function: tls_peerconnection_write_function,
        validate_addr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_peerconnection_get_write_msg(
        channel: *mut TLSRTCPeerConnection,
        buf: *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_peerconnection_get_read_msg(
        channel: *mut TLSRTCPeerConnection,
        buf: *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_peerconnection_status(channel: *mut TLSRTCPeerConnection) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_destroy_peerconnection(channel: *mut TLSRTCPeerConnection);
}
extern "C" {
    pub fn tls_cert_fingerprint(
        pem_data: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
        buffer: *mut ::std::os::raw::c_char,
        buf_len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_load_root_certificates(
        context: *mut TLSContext,
        pem_buffer: *const ::std::os::raw::c_uchar,
        pem_size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_default_verify(
        context: *mut TLSContext,
        certificate_chain: *mut *mut TLSCertificate,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_print_certificate(fname: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn tls_add_alpn(
        context: *mut TLSContext,
        alpn: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_alpn_contains(
        context: *mut TLSContext,
        alpn: *const ::std::os::raw::c_char,
        alpn_size: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_alpn(context: *mut TLSContext) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn tls_clear_certificates(context: *mut TLSContext) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_make_ktls(
        context: *mut TLSContext,
        socket: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tls_unmake_ktls(
        context: *mut TLSContext,
        socket: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dtls_reset_cookie_secret();
}
extern "C" {
    pub fn tls_remote_error(context: *mut TLSContext) -> ::std::os::raw::c_int;
}
pub type SSL_CTX = TLSContext;
pub type SSL = TLSContext;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SSLUserData {
    pub fd: ::std::os::raw::c_int,
    pub certificate_verify: tls_validation_function,
    pub recv: *mut ::std::os::raw::c_void,
    pub send: *mut ::std::os::raw::c_void,
    pub user_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SSLUserData"][::std::mem::size_of::<SSLUserData>() - 40usize];
    ["Alignment of SSLUserData"][::std::mem::align_of::<SSLUserData>() - 8usize];
    ["Offset of field: SSLUserData::fd"][::std::mem::offset_of!(SSLUserData, fd) - 0usize];
    ["Offset of field: SSLUserData::certificate_verify"]
        [::std::mem::offset_of!(SSLUserData, certificate_verify) - 8usize];
    ["Offset of field: SSLUserData::recv"][::std::mem::offset_of!(SSLUserData, recv) - 16usize];
    ["Offset of field: SSLUserData::send"][::std::mem::offset_of!(SSLUserData, send) - 24usize];
    ["Offset of field: SSLUserData::user_data"]
        [::std::mem::offset_of!(SSLUserData, user_data) - 32usize];
};
extern "C" {
    pub fn SSL_library_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SSL_load_error_strings();
}
extern "C" {
    pub fn OpenSSL_add_all_algorithms();
}
extern "C" {
    pub fn OpenSSL_add_all_ciphers();
}
extern "C" {
    pub fn OpenSSL_add_all_digests();
}
extern "C" {
    pub fn EVP_cleanup();
}
extern "C" {
    pub fn SSLv3_server_method() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SSLv3_client_method() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SSL_new(context: *mut TLSContext) -> *mut TLSContext;
}
extern "C" {
    pub fn SSL_CTX_use_certificate_file(
        context: *mut TLSContext,
        filename: *const ::std::os::raw::c_char,
        dummy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SSL_CTX_use_PrivateKey_file(
        context: *mut TLSContext,
